app/controllers/enderecos_controller.rb

  def index
    @enderecos = Endereco.all
---
SELECT "enderecos".* FROM "enderecos"

  def show
    @endereco = Endereco.find(params[:id])
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = 1 LIMIT 1

  def edit
    @endereco = Endereco.find(params[:id])
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = 5 LIMIT 1

  def create
    @endereco = Endereco.new(params[:endereco])

    respond_to do |format|
      @resp_endereco = get_endereco(@endereco.cep)
      if @endereco.save
---
INSERT INTO "enderecos" ("created_at", "cep", "updated_at", "complemento") VALUES ('2011-06-27 22:36:30.320179', '13020060', '2011-06-27 22:36:30.320179', 'O que eu quiser')

  def update
    @endereco = Endereco.find(params[:id])

    respond_to do |format|
      if @endereco.update_attributes(params[:endereco])
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = 5 LIMIT 1
UPDATE "enderecos" SET "updated_at" = '2011-06-17 23:06:19.682679', "cep" = '13083852' WHERE "enderecos"."id" = 5

  def destroy
    @endereco = Endereco.find(params[:id])
    @endereco.destroy
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = 6 LIMIT 1
DELETE FROM "enderecos" WHERE "enderecos"."id" = 6