app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produtos = Produto.all

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 0 LIMIT 1
---
  def show
    @produto = Produto.find(params[:id])

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 1 LIMIT 1
---
  def edit
    @produto = Produto.find(params[:id])

INSERT INTO "produtos" ("nome", "preco", "descricao", "quantidade", "updated_at", "created_at") VALUES ('geladeira asdjadsad', NULL, '', NULL, '2011-05-27 01:03:40.939763', '2011-05-27 01:03:40.939763')
---
  def create
    @produto = Produto.new(params[:produto])

    respond_to do |format|
      if @produto.save

SELECT "produtos".* FROM "produtos" WHERE (nome LIKE '%asdasdasdas%')
---
  def efetua_busca
    @produtos = Produto.where("nome LIKE '%#{params["produto"]["nome"]}%'")